/*
  В старых IE8- не поддерживалось свойство which,
  а вместо него использовалось свойство button, которое является 3-х битным числом,
  в котором каждому биту соответствует кнопка мыши.
  Бит установлен в 1, только если соответствующая кнопка нажата.
*/
function fixWhich(e) {
  if (!e.which && e.button) { // если which нет, но есть button... (IE8-)
    if (e.button & 1) e.which = 1; // левая кнопка
    else if (e.button & 4) e.which = 2; // средняя кнопка
    else if (e.button & 2) e.which = 3; // правая кнопка
  }
}
